# StairsIllegalDesiredNumRisers Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsIllegalDesiredNumRisers Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Desired Number of Risers is too small. Computed Actual Riser Height is greater than Maximum Riser Height allowed by type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsIllegalDesiredNumRisers { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsIllegalDesiredNumRisers As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsIllegalDesiredNumRisers {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace